# SQL - Joins 
    What are Joins?
    Joins are used to combine rows from two or more tables based on a related column (usually a primary key â†” foreign key).
    In real-world data analysis:
    - Data is never in one table
    - Information is normalized across multiple tables
    - Joins allow you to reconstruct complete information

### Database Connection

In [5]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [7]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Create Table employees1

In [12]:
%%sql
CREATE TABLE employees1 (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    department_id INT,
    salary INT
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

### Create Table department

In [15]:
%%sql
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50)
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

### Insert Sample Data

In [20]:
%%sql
INSERT INTO departments VALUES
(1, 'IT'),
(2, 'HR'),
(3, 'Finance'),
(4, 'Marketing');

 * mysql+pymysql://root:***@localhost/test
(pymysql.err.IntegrityError) (1062, "Duplicate entry '1' for key 'PRIMARY'")
[SQL: INSERT INTO departments VALUES
(1, 'IT'),
(2, 'HR'),
(3, 'Finance'),
(4, 'Marketing');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [24]:
%%sql
INSERT INTO employees1 VALUES
(101, 'Amit', 1, 60000),
(102, 'Neha', 2, 45000),
(103, 'Ravi', 1, 70000),
(104, 'Pooja', 3, 50000),
(105, 'Karan', NULL, 40000);

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[]

In [34]:
%%sql
select * from departments;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(1, 'IT'), (2, 'HR'), (3, 'Finance'), (4, 'Marketing')]

In [38]:
%%sql
select * from employees1;

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 1, 60000),
 (102, 'Neha', 2, 45000),
 (103, 'Ravi', 1, 70000),
 (104, 'Pooja', 3, 50000),
 (105, 'Karan', None, 40000)]

###  1. INNER JOIN
    - Rows that have matching values in both tables
    - Rows without a match in either table are excluded

###  INNER JOIN - Returns only matching records from both tables

In [45]:
%%sql
SELECT 
    e.emp_name,
    d.department_name,
    e.salary
FROM employees1 e
INNER JOIN departments d
ON e.department_id = d.department_id;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[('Amit', 'IT', 60000),
 ('Neha', 'HR', 45000),
 ('Ravi', 'IT', 70000),
 ('Pooja', 'Finance', 50000)]

- Employees without a department are excluded
- Departments without employees are excluded

###  2. LEFT JOIN [ LEFT OUTER JOIN ]
    - All rows from the left table
    - Matching rows from the right table
    - NULL in right-table columns where no match exists

### LEFT JOIN - Returns all records from left table + matched records from right table

In [58]:
%%sql
select
   e.emp_name,
   d.department_name,
   e.salary
from employees1 e
left join departments d
on e.department_id = d.department_id;

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[('Amit', 'IT', 60000),
 ('Neha', 'HR', 45000),
 ('Ravi', 'IT', 70000),
 ('Pooja', 'Finance', 50000),
 ('Karan', None, 40000)]

- Karan appears with NULL department
- No employees are lost

###  3 RIGHT JOIN [ RIGHT OUTER JOIN ]
    - All rows from the right table
    - Matching rows from the left table
    - NULL in left-table columns where no match exists

### RIGHT JOIN - Returns all records from right table

In [91]:
%%sql
select e.emp_name, d.department_name, e.salary
from employees1 e
right join departments d
on e.department_id = d.department_id;

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[('Amit', 'IT', 60000),
 ('Neha', 'HR', 45000),
 ('Ravi', 'IT', 70000),
 ('Pooja', 'Finance', 50000),
 (None, 'Marketing', None)]

###  4. FULL JOIN [ FULL OUTER JOIN ]
    - All matching rows
    - All non-matching rows from both tables
    - NULL wherever a match is missing

### FULL OUTER JOIN - Returns all records from both tables

In [101]:
%%sql
SELECT 
    e.emp_name,
    d.department_name
FROM employees1 e
LEFT JOIN departments d
ON e.department_id = d.department_id

UNION

SELECT 
    e.emp_name,
    d.department_name
FROM employees1 e
RIGHT JOIN departments d
ON e.department_id = d.department_id;

 * mysql+pymysql://root:***@localhost/test
6 rows affected.

[('Amit', 'IT'),
 ('Neha', 'HR'),
 ('Ravi', 'IT'),
 ('Pooja', 'Finance'),
 ('Karan', None),
 (None, 'Marketing')]